{"meta":{"title":"Ragvivsw'ramble","subtitle":"orRecord","description":"不如记录","author":"Ragvivsw","url":"https://ragvivsw.space","root":"/"},"pages":[{"title":"","date":"2020-07-16T11:18:52.970Z","updated":"2020-07-16T10:49:38.301Z","comments":true,"path":"ls-README.html","permalink":"https://ragvivsw.space/ls-README.html","excerpt":"","text":"LandscapeA brand new default theme for Hexo. Preview InstallationInstall1$ git clone https://github.com/hexojs/hexo-theme-landscape.git themes/landscape Landscape requires Hexo 2.4 and above. If you would like to enable the RSS, the hexo-generate-feed plugin is also required. EnableModify theme setting in _config.yml to landscape. Update12cd themes/landscapegit pull Configuration123456789101112131415161718192021222324# Headermenu: Home: / Archives: /archivesrss: /atom.xml# Contentexcerpt_link: Read Morefancybox: true# Sidebarsidebar: rightwidgets:- category- tag- tagcloud- archives- recent_posts# Miscellaneousgoogle_analytics:favicon: /favicon.pngtwitter:google_plus: menu - Navigation menu rss - RSS link excerpt_link - “Read More” link at the bottom of excerpted articles. false to hide the link. fancybox - Enable Fancybox sidebar - Sidebar style. You can choose left, right, bottom or false. widgets - Widgets displaying in sidebar google_analytics - Google Analytics ID favicon - Favicon path twitter - Twiiter ID google_plus - Google+ ID FeaturesFancyboxLandscape uses Fancybox to showcase your photos. You can use Markdown syntax or fancybox tag plugin to add your photos. 123![img caption](img url)&#123;% fancybox img_url [img_thumbnail] [img_caption] %&#125; SidebarYou can put your sidebar in left side, right side or bottom of your site by editing sidebar setting. Landscape provides 5 built-in widgets: category tag tagcloud archives recent_posts All of them are enabled by default. You can edit them in widget setting. DevelopmentRequirements Grunt 0.4+ Hexo 2.4+ Grunt tasks default - Download Fancybox and Font Awesome. fontawesome - Only download Font Awesome. fancybox - Only download Fancybox. clean - Clean temporarily files and downloaded files."},{"title":"about","date":"2020-07-16T12:00:36.000Z","updated":"2020-07-16T12:02:23.411Z","comments":true,"path":"about/index.html","permalink":"https://ragvivsw.space/about/index.html","excerpt":"","text":""},{"title":"contact","date":"2020-07-16T16:19:38.000Z","updated":"2020-07-16T16:19:38.200Z","comments":true,"path":"contact/index.html","permalink":"https://ragvivsw.space/contact/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-07-16T12:00:30.000Z","updated":"2020-07-16T12:02:12.896Z","comments":true,"path":"categories/index.html","permalink":"https://ragvivsw.space/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-07-16T12:00:05.000Z","updated":"2020-07-16T12:01:53.613Z","comments":true,"path":"tags/index.html","permalink":"https://ragvivsw.space/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"207-25 时间","slug":"207-25-time","date":"2020-07-25T15:27:29.000Z","updated":"2020-07-29T14:25:44.000Z","comments":true,"path":"2020/207-25-time/","link":"","permalink":"https://ragvivsw.space/2020/207-25-time/","excerpt":"突然意识到自己的时间管理有够差。就是说没有意识。 触发点是看到一篇文章写的久坐问题","text":"突然意识到自己的时间管理有够差。就是说没有意识。 触发点是看到一篇文章写的久坐问题。 是老生常谈，1 小时至少站起来个 5 分钟。 自己有设屏保的，25 分钟一次。 没什么用了越来越。 一开始是会有意识地活动。 懈怠了。 其实说起来 5 分钟真的不算什么。 跟每天浪费的时间比起来。 早上 7 点起和 9、10 点就差了几个小时。 当然后者是因为晚上 2 点才睡。 这个先不说。 看文章也花了很久时间，一篇几分钟。 话说写起来才发现很难啊，几百字放公众号略滑一下就到底。 不过想想语文 800 字也一直够呛，一直不够模板化的原因吧。 有次找标了阅读需 2.3 分钟的，一看，2000 多字，啧。 想想之前弄简书、Blog 也是因为逼着自己写到规定字数才。 可不能这样了，就像练字一样，不想练了直接留下一天，千万别烦。 说回。 对时间的感知非常混乱。 晚上刷牙洗脸，看别人在洗衣服。 就想着大家都好厉害，天天认真学习那么久，还有充足的时间干这些。 仔细想想，看集番 20 分钟，三集小时，一部，通常是 12 集，半天没了。 但是站了个十几几十秒就开始觉得好久，是不是可以坐下了。 当然也是因为太沉迷了。 还有每日答题，虽然要不了几分钟，就是觉得麻烦，甚至不怎么需要动脑。自己想反而会错，毕竟书没看过多少，很多常识也不知道。 之前一直说放假了留学校里可以跑跑步什么的，也没动过。 因为时间打算在晚上，然后等反应过来，而且也没那么抗拒，一般都 10、11 点了，然后就因为时间原因不想去了。 还有各种事，比如中午再洗漱一次，也经常不去。还有洗碗也会拖很久，当然洗还是会洗的。 都是些小事，但坚持很难。 学习就更加，每天花点时间在英语上啊。之前总是跟别人说英语不好，也知道英语非常重要，要花很多时间。 结果一点都没花。 最近越来越飘了，不喜欢的索性不做。 也有室友的原因。 学霸旅游去了之后，都在娱乐，游戏小说。 当然不能推给别人。 想不到要怎么样激起学习的行动。 做喜欢的事的时候时间过得很快。充实的时候也是。 一下就过去了，然后得回到讨厌但是重要的东西上。 度日如年的，时间有够奇怪。 这叫什么， 相对论？ 封面来源: Unsplash | https://unsplash.com/photos/BXOXnQ26B7o","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[]},{"title":"207-24 理发","slug":"207-24-haircut","date":"2020-07-24T12:12:56.000Z","updated":"2020-07-25T14:02:32.000Z","comments":true,"path":"2020/207-19-haircut/","link":"","permalink":"https://ragvivsw.space/2020/207-19-haircut/","excerpt":"5 月 14 过来的，两个多月了，第一次出校门。 头发当然很长，不过似乎不如在家里留的","text":"5 月 14 过来的，两个多月了，第一次出校门。 头发当然很长，不过似乎不如在家里留的。 只有一个校门出去，当然文件下来之前只能请假，我是一直觉得太严了，完全没必要。 去的上次留校或是放假去的那家，就去过一次。 平时都去另一个校门的，但是没办法。 不是老板，看技术是学徒的样子，跟那家一样，一个技术高的老板，和一个一般般的。 就说是学徒也不如另一家，看来学得不怎么样。 推子直接朝耳朵怼，第一次知道原来这么吵。 当然可能是太久没剃了，也可能是中午没睡神经又衰弱。 剪子用得不流畅，就是不流畅，各种意义，不只是因为一点点剪的那种。 还要握握头发来看长度，或者是为了其他，反正没见过之前。 走路也不大注意，几次踩到鞋子，因为穿的拖鞋比较注意，还好都没踩实。 话不多，和那家店一样。 旁边老板在给室友唠着，也好，喜欢安静。 就开始乱想。 自己的头发只能说自己现在的头发，毕竟过几个月就全换了。 自己身上似乎没有多少是自己的。 大脑？好像没了。 再说就是基因了。 那么你只能说是一块大脑，和一串 DNA 的排列组合。 这是物理上的，精神上的呢？ 记忆，没了。 全部的感性理性认识，都是基于过往的一切。 但连记忆也是模糊不清的。 可悲啊，人类。 当然自己的认知实属一般，胡思乱想很多也都是错的。 就这样吧，懒得去查证了。 说回理发。 剪完了，再洗一次？算了，待会洗澡。 店里的洗发水不怎么样，洗澡的时候感觉头发很涩，当然不清楚是不是因为这个，而且这是后话了。 结账，涨价，不办卡 25 一次，记得上次 15，看门口牌子也是洗剪吹 15，可能是没仔细看。 办卡 50 三次，上次老板给剪的，也是提着办卡的事，应该是 100 八次？记不清了。 办呗，不然太亏了，毕竟不知道另一个校门会不会开。 那家年前刚充了 120，八次。 当然就不在意了，只能说过去花的钱都不是自己的了，所以投资确实是很好的选择，白捡钱一样。 说回，主要是这家技术更好我觉得，附近另一家年前不办卡也是 15，但去一次就算了。 老板看起来也更加实在，Tony 老师也看脸啊。 就回来了，洗澡，头发不好受，可惜搬寝室没带护发素，太急了。 才想起来前两次的衣服没洗，一直说手洗来着， 泡了四五天了。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"school","slug":"school","permalink":"https://ragvivsw.space/tags/school/"}]},{"title":"207-23 平板","slug":"207-23-iPad","date":"2020-07-22T16:01:29.000Z","updated":"2020-07-26T11:05:45.000Z","comments":true,"path":"2020/207-23-iPad/","link":"","permalink":"https://ragvivsw.space/2020/207-23-iPad/","excerpt":"给平板配了键盘之后用了一段时间，打字的时候那个虚拟键盘一直都在","text":"给平板配了键盘之后用了一段时间，打字的时候那个虚拟键盘一直都在。 不光占位置，要选字的时候还得去点，用数字是没用的，今天才去搜了一下，在贴吧看到了解决方法。 得关掉两个地方，就很迷，说是为了方便没有键盘的人用鼠标打字，不大清楚。 不过一般的热门键盘都会有一键切换按钮，挺方便。当然我的没有。毕竟小众，而且是欧版。 说回键盘，本来 Windows 下的键位就不同，欧版的按键看起来更是奇奇怪怪。 当然能用就是，键盘买回来的时候 f 键抽风，不知道是不是本来就有问题还是快递暴力。不过看包的挺严实的，估计是卖家不诚实。 最后是把键帽用点力撬了几次，现在用着还好。 偶尔还是会抽风，撬着撬着莫名其妙也就好了。没好就多来几次，只能先将就着了。 跟卖家说了一下，退了一部分钱，这倒是意料之外。 习惯性给了好评，就别在这上面浪费时间了。 说回板子，iOS 的生态不知道，但是系统做得确实是一流。 各种流畅的非线性动画加上这 120Hz 的 LCD 屏幕，用着着实是享受。在设置里试过降帧，感知很强。 也因为屏幕和帧率，电用得很快，特别是看视频的时候。不过看番注意不到时间也是很大的原因，再省电也没用。 四扬声器也是用过最好的，相比之下电脑是真得差劲。当然因为在寝室就算了，都得老老实实上耳机。 以及运存管理，应该说后台管理，没用过确实难以想象，只能说封闭有封闭的好。 因为习惯了安卓加国产软件各种流氓式操作，不用些额外的手段实在想不到退出程序之后还真就退出了。这一晚上一点电不掉对安卓机来说也是奢望。 各种交互也很舒服，比如这个鼠标的选择方式，倒是从没想过能这么设计，不得不叹服。 之外还有很多设计，暂时说不出来就算了。比如屏幕使用时间，各种使用确实是一目了然，天天浪费那么多时间。 真有种全 iOS 的冲动，毕竟想想之前花的时间最多的还是电脑上，各种统计确实很想直观地看下。 当然这代价还是挺大的，没钱确实玩不来。 只能说各种问题归根到底， 还是钱的问题。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"device","slug":"device","permalink":"https://ragvivsw.space/tags/device/"}]},{"title":"207-22 思考","slug":"207-22-thought","date":"2020-07-21T16:01:29.000Z","updated":"2020-07-26T15:17:25.000Z","comments":true,"path":"2020/207-22-thought/","link":"","permalink":"https://ragvivsw.space/2020/207-22-thought/","excerpt":"Photo by Alexandru Goman on Unsplash 的只有夜深人静了 ，才开始胡思乱想 。 好似一直是这样 ，越是安静，思维越活跃","text":"Photo by Alexandru Goman on Unsplash 的只有夜深人静了 ，才开始胡思乱想 。 好似一直是这样 ，越是安静，思维越活跃 。 这么看，要是打算聊些想看法之类，应该在三更半夜找我。 当然得我没睡 ， 一到白天就不想说什么了，单纯看着便足矣 。 打字也是，若是白天，会想着这些个东西有甚么写出来的必要吗 。 之前的很多事，也找到了些许原因 。 可谓是见光死 。 自己所做的 ，想让人了解，又不想让人知道 。 打字也是，搭网站也是 。 就是看到了，也是不要评论为好 。 一说就觉得难堪 。 属于知道自己做得不好，狠下心来做了 ，便已经是极限了。 若是谁再那么一评论 ，哎呀呀，哎呀呀 ， 就没有动力了 。 还有学习也是，不想让人知道自己在学习。 也不是说想隐藏着什么的。主要是说是在学习，但更多的其实是在玩。 是真的无心学习。 也不是说沉迷游戏，最近也不玩了。 学习总是想用到一些道具。譬如期末考试，就说那门最接近挂科的。 上一门考完后还剩半天多的时间复习。 浪费了半个下午先。 因为没什么笔记，先是打算按照大纲把知识点整理到文档里，然后发现太慢了。 打字慢，要点又多又杂的。 老老实实用书。 也不是纸质，因为板子上的课本里还有一点笔记。 开始整理。 最麻烦的是什么呢？ 总想着尽善尽美。 各种没必要。 线画得直不直、划线和字的间隔宽了窄了、荧光笔画的最左端有没有对齐… 弄过来的图片是不是要裁剪一下、文本框的大小和底色要不改一改、这图片是不是被挡了东西… 这一页要删掉吗、虽然没有笔记但是还可能用到吧、要不还是留着，虽然最后一眼都没看… 之后很多零零碎碎的知识点还是整理到了文档里，又是各种打字排版换字体调边距，浪费时间。 最后是靠着再在纸上抄一遍来强行记忆。 因为背的没效果，完全背不下去。 就是不想。 自从回学校，不，自年初就这样了。 确实完全打乱了生活轨迹。 越来越下去了。 平常思考，或说胡思乱想的也不是学习，净是些杂七杂八的。 静不下心。 肯定是和睡眠质量有关，自大事之后——其实还能再往前追溯，就没必要了——睡眠就不行了，思想愈加混乱。 果然还是不要总出去，外面，太吸引人，各种意义的。 没办法，逆反心理还是有的，越，就越，隐政呃于是便愈吸引人。 还要考政治呢，150 分，这怎么行，老老实实待里面。 思想纯一些吧，至少， 先熬过这关。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"think","slug":"think","permalink":"https://ragvivsw.space/tags/think/"}]},{"title":"练字","slug":"Practice-words","date":"2020-07-19T13:12:34.000Z","updated":"2020-07-20T13:26:01.000Z","comments":true,"path":"2020/Practice-words/","link":"","permalink":"https://ragvivsw.space/2020/Practice-words/","excerpt":"207-20 第「二」天","text":"207-20 第「二」天 Day 2参考字帖：第一页 莫得感情的划线机器. PW07200 Day 1参考字帖：第一页 *看着画出的弯曲的线条像扭曲的栅栏一样把你阻拦在练字的大门外,这使你充满了决心. PW07190 Day 0字帖到了，开始练字 图源知乎","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"Persist","slug":"Persist","permalink":"https://ragvivsw.space/tags/Persist/"}]},{"title":"207-19 金钱","slug":"207-19-money","date":"2020-07-18T16:01:29.000Z","updated":"2020-07-19T12:04:32.000Z","comments":true,"path":"2020/207-19-money/","link":"","permalink":"https://ragvivsw.space/2020/207-19-money/","excerpt":"愈发意识到钱的重要性。 算了一下，一天吃饭吃了","text":"愈发意识到钱的重要性。 算了一下，一天吃饭吃了25。 也不是说很多吧，月750，但这是基本消费 想之前大一的时候，一个月消费不会过700吧。 确实是有意识地省着，天天逛羊毛群不亦乐乎。 都是高中人家玩剩下的。 还是接触太晚。 这类群基本都退了，留着的也全屏蔽了，完全屏蔽的那种。 那最近又想着撸毛了。 想给板子配一套蓝牙键鼠，倒是后悔之前买的无线鼠标，得连接收器，只够电脑用用。 其实年前还没出大事的时候看 iPad 的教程就有推荐的键盘，那时候没钱，就没有考虑过键鼠，现在已经找不到了。 考虑过原装的、百来块钱很火的，然后看到有人十几块买了个，甚至不到10块都有，还是旗舰店。 车早走了，下一次也不知道。 只能说直播对部分消费者，还是很实惠。 心里就不平衡了。 其实跳出来想想，也就十几块。 没必要，真的。 前几天洗被套，花了十多，也没什么感觉；还有那些付费文章，有的一篇十几。 因为花的是银行卡里的看不到？ 然后今天赶快在闲鱼选了个近两百的，有小红点的。 直接就付了钱，赶快解决吧，时间宝贵。 想想之前买板子，几千也花出去了。 当然这笔是值，放现在是赚不少。 还有手机，一千五，买的时候没注意电池，亏了一些。 也就这样，不多出点确实买不到好东西。 就想啊，看的很多公众号主都月入过万，大十几几十的也不少。 那么买一套 Pro11 + 妙控，万来块似乎也不算什么。 当然，是说都有经济来源，所以钱确实自己的，而且看着增加。 想那些能经常测评数码的，也都很好，加上测评也能获益。 共同的特征是什么呢？ 能心安地买自己想要的。 不用考虑太多。 从开始的吃饭，不用多想吃什么，然后盯着标价算钱，不用在意打菜少了，顺便带瓶饮料也不必挑着便宜的… 到自己想买的一切东西，当然是日常用品，都不必太过在意价钱，不用看了又看，然后因为小十几几十的差价纠结半天，拖上十天半个月还没决定好。 年前买板子，纠结了很久，说两三个月不为过，真的。 从苹果看到田牌，再到安卓，最后回到苹果，从二手看到全新，淘宝苏宁京东拼多多，再回到咸鱼… 当然确实不是小件，但是终归是要买的。 花钱省时，主要是省心，可以专心在想做的事上。 真想省也省不下多少，看文章所说，以及亲身体验。 当然眼光放远一些。 只能说赚钱这事， 最体现能力。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"money","slug":"money","permalink":"https://ragvivsw.space/tags/money/"}]},{"title":"207-17 博客","slug":"207-17-blog","date":"2020-07-17T10:23:35.000Z","updated":"2020-07-17T10:39:30.000Z","comments":true,"path":"2020/207-17-blog/","link":"","permalink":"https://ragvivsw.space/2020/207-17-blog/","excerpt":"又去把网站搭起来了，折腾了两天。毕竟不能白瞎了十年的域名，虽然没有备案什么的，不过现阶段都不是重点","text":"又去把网站搭起来了，折腾了两天。毕竟不能白瞎了十年的域名，虽然没有备案什么的，不过现阶段都不是重点。 弄这种不会的，就是边搜边做。 当然说是在实战中经验提升最快，但是如果连基础知识都没有，那其实都只是白搭，也就是在之后的系统学习里可能会有些熟悉的感觉，其他就没什么了。 就像自己写了两个脚本，也就是初步理解了几个函数具体的功能，都是抄的。 抄还抄不好。 系统学习才是王道，省时省力。 那么说回 blog 。 一开始的步骤都是顺的，毕竟弄过几次了。 搭了两天，一天半的时间是在改主题。 换了四五个，没有满意的。 也不是说没有，就是差那么点意思，眼看就… 不会改。 就换回用了几次的那个主题。 大致换了下背景，调了些透明度，加了俩特效… 只看出一个，另一个没弄出来。 捣鼓老久，算了，没必要。 就这么用着先，还是，现阶段都不是重点，字都没打多少，有意思？ 当然瞎玩的确有，但没那么多时间给浪。 先将就用着，待学了汇编，C，Py，再来会会 Html 。 学不进去主要。 没有动力，没有精力。 失眠得厉害，睡不好自然没精神。 这在之后写，继续 blog 。 花里胡哨的也没弄了，什么计数、评论、页脚、音乐… 怕又折腾老久，现在也不早了。 以后再说，兴许得再换换主题。 加载太慢，一是背景，二是动画。 背景图已经转成 webp 了，还是慢。 也没有什么图床支持这格式，不知道为什么，一分享出来，还是 .ipg 。 动画难改，得去找对应文件，主要是改，不会。 之前还加过头像旋转的，弄了挺久，没改出想要的。 想来是能实现的，能力不足。 加起来，先得等图加载完了，再出贼慢的动画，才出字。 当然这先后顺序就更是复杂的内容了，退一步说，图片还能再压一压，动画也勉强能改改。 网页框架的事就算了，怎么得搞崩溃几次。 先将就着吧，反正，没人。 那还是搭了，至少是有这么个地方。 总是留了点东西。 这就算是第一篇了，前几次的就算了，上次的直接被顶没了，倒是可惜。 也不可惜，看样子是能回滚，但还是算了，之后再看。 也没弄引擎收录，困了，一天没怎么挪地。 还有其他事。","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"https://ragvivsw.space/tags/blog/"}]},{"title":"207-15 期末","slug":"207-15-finals","date":"2020-07-15T07:12:34.000Z","updated":"2020-07-21T05:03:27.000Z","comments":true,"path":"2020/207-15-finals/","link":"","permalink":"https://ragvivsw.space/2020/207-15-finals/","excerpt":"出了一门成绩 差两分挂科。 老师人好，只能怪自己不学","text":"出了一门成绩 差两分挂科。 老师人好，只能怪自己不学。 就是熬夜的那科，合着没学多久。 最后一整段的复习时间是连10小时都没有。 松了一口气。 当然考得差是没什么好说的，像上上次一样，拉低绩点。 而且对我来说是重要的学科，对，那次也是。 总是考太差才发现这课是重中之重。 追悔莫及，无可奈何。 怎么放松呢？ 没出成绩之前是想着能不能拿奖学金的。 就是出了两门没上 80 的，也还想着。 就是不能给丁点希望。 那么反而就不紧张了，可能性归零。 其他科目多少也没之前那么重要。 也在打着音游。 想着是一个道理。 精确度有五个档次，头两档能拿满分。 那么按满分 100，评价也有五等。 一等满分，隔 5 分二三等，再隔 10 分四等，五等不管。 但凡有一个点岔了。 精确度三档开外。 至少差上 1 分。 眼看一等没指望了，就不会绷着了。 毕竟要掉到三等还有几次出错的机会。 对，容错反而增加。 而那些只能拿四等的更加。 倒是没拿二三等那么放松，因为没什么兜底。 但是玩着倒是不亦乐乎，倒不是说喜欢被虐。 但会错过很多，就跟捡分一样，往死里点着就对了。 也不用考虑精准度，能点到就不错。 对，期望是降低了，毕竟实力在那里。 那么学习排名也是。 当然现在没什么用，至少对我来说。 123 名是要绷着的。 从第 1 到第 2 和从第 7 到第 8，不是一个概念。 那么二三十开外，差上十几名才有感觉。 想到个词， 边际收益递减。","categories":[{"name":"study","slug":"study","permalink":"https://ragvivsw.space/categories/study/"}],"tags":[{"name":"relation","slug":"relation","permalink":"https://ragvivsw.space/tags/relation/"}]},{"title":"207-14 放纵","slug":"207-14-indulge","date":"2020-07-13T16:12:34.000Z","updated":"2020-07-21T02:56:02.000Z","comments":true,"path":"2020/207-14-indulge/","link":"","permalink":"https://ragvivsw.space/2020/207-14-indulge/","excerpt":"考试或者别的什么之后一定是放纵。 不是游戏就是B站视频","text":"考试或者别的什么之后一定是放纵。 不是游戏就是B站视频。 往往两个都有。 一是自己的问题。 二是环境。 只能说二本学校毕竟是二本。 除了学习氛围，也有各种吐槽的。 总是不好的。 得想想办法控制。 但是没什么效果。 强迫着忍着，一段时间后只会是更大的反扑。 只能说该浪费的时间还是得好好地浪费掉。 当然不能完全听天由命。 B站就多看知识科普类up，像罗老师 仙人 回形针是看得最多的。 其他的也有，偶尔看看。 都更新得不快。 番剧没办法，尽量找泡面番，追番也不错，都是周更，多想看也没办法。 那么游戏。 手机没有，习惯了，也只用二手破手机，看看公众号就行了。 电脑，steam好久没动过了。 首先是挑大一点的游戏，像巫师，加上steam，启动、过场都要半天的。 没太大动力打开。 当然得先通关了，这还是得玩上一段。 所以游戏是有的，也好玩，但就不怎么想开了。 平板。 有个音游，毕竟这也是买的原因之一。 也同理，开场慢，打开就有压力。 加上有难度，玩不好找罪受。 也好一些。 当然说的都是平时，像一些相对比较折磨人的事之后，或者是之前。 考试、旅途、实验之类。 就控制不了了，难收住。 对，说的就是这次。 停不下来，完全的那种。 下意识地也不想控制一下，就这么玩下去了。 主要是没有通关，虽说音游的剧情肯定不会太好，公认的。 但就是太喜欢故事了，不管是多烂多差的故事，都有看下去的想法。 当然这剧情算是好的，不是平铺直叙，多得靠自己想像。 平常是感觉一般的，因为精力不在这，就喜欢直白的，游戏也挑那种无脑的，虽然玩得不多，比如死火。 但是考完试了，感觉精力无从安放，加上睡眠依旧不好。 先通关吧，主线剧情打完估计会好一些。 唯一的阻碍是人名，外国人名总是不好记，加上很多都是开头字母相同的，经常分不清楚。 那就没那么入戏，看混了就尴尬了。 游戏里面还是有些学问的，贵的是有道理，而且难度也高。 当然得说各种游戏都没那么简单。 看贴吧里讨论的也不错，各种分析，经常有新人入坑。 不太想参加就是。 补： 主线的主要剧情打通了，离大结局还有一段。 突然不想玩了。 统计一下时间： iPad 一共打了 20 多个小时… 当然还是 B站 时间没有全部统计，不然比这长多了。 想想自己又不是后浪… 放纵过头了还是。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"play","slug":"play","permalink":"https://ragvivsw.space/tags/play/"}]},{"title":"207-10 分别","slug":"207-10-separate","date":"2020-07-10T14:25:35.000Z","updated":"2020-07-27T15:52:47.000Z","comments":true,"path":"2020/207-10-separate/","link":"","permalink":"https://ragvivsw.space/2020/207-10-separate/","excerpt":"","text":"大学留了一个组织，三年，当然正式干活也就一年半，这半年更是，就当不存在吧。 同部门四个，同级的也就七个。实习 / 培训，都走了。 最后一人留着吃了顿饭，简简单单。 说实话不习惯跟别人吃饭，没什么聊的，尬着难受。 一是各个方面相差的太多，当然这是自己主观因素。二是自己习惯当旁观者，只是看着故事发展。 像平常的一些事，也不会记着，不如说刻意忘记，过去了就算了这样。现在因为打字才强行让自己记着。 所以越是平常的话题越插不上话，除非聊一些比较针对性的东西。但那也没太多可以说的。 当然这都是我自己觉着。别人邀了，自然奉陪到底。 硬是拖了两个半钟头。 忍着没看手机，太习惯了，动不动就伸手。 聊了些家长里短的。主要还是高考相关，记得比较清楚。 因为时间距离比较近，心智发育得也还勉强，所以才有感觉。 那时多天真啊，太天真了就是。自己没有坚持，不然… 当然现在看过去的每一步都是错的，错得离谱，就不展开了现在。 也说着如果之后是去哪里哪里发展的话，以后再能见面的难易。 再有就是大家的近况，因为在群里一直都是潜水，感觉插不上话。以前喜欢发表情包来着，也不想，或者说不知道发什么合适了。 线下在年后基本也没什么交集了，毕竟都有自己的事。 主要是自己一直这样，过去的朋友也没有联系了。 一个都没。 从不主动联系，想着大家都有自己的生活，有了新的同学朋友。如此不久好了吗？珍惜当下。 过去的就过去吧，留在回忆里就好了。 当然主要也还是自己的问题，这里不细说了，偏题。 那么说回。 不过其他的就记不大清了，自己的脑子啊，太不争气。 没话说了也就干等着，只是不想太快结束。 不过很多事，确实是第一次说出来，对着别人。 性格这样，你不专心听，我也没有讲的欲望。 很多事会在心里倒腾老久，自言自语的，想着一对一的场景，再慢慢地有一搭没一搭地聊。 不过也就这么想想罢了。 毕竟想说也说不出太多，都忘干净了，嫌无聊。临要自己说了，才知道自己语言组织能力的差劲。 偶尔说到一些时事，也限于你听过…听过的如此，没有思考过，自然没有深入下去的想法。 到底是朋友少还是不愿说呢，反正都是自己的问题。 近八点要走了，去超市带了点东西。自己什么都没买，似乎没做对。 现在想来，至少捎瓶饮料啊，空着手总是不好的。 终是要结束的，路上还是尽量走慢些。 无言。 还是有些故事的感觉了，自己的故事，感觉奇妙。 真真切切有种主角的感觉，当然也因为朋友的不断暗示烘托，氛围我才感觉到了。 毕竟真没意识到，这确是最后的几面了。 到岔路口了，拜拜就是了，年后再会吧。再有什么似乎也没有意义了，毕竟就这么两人儿。 没有回头。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"people","slug":"people","permalink":"https://ragvivsw.space/tags/people/"}]}],"categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"},{"name":"study","slug":"study","permalink":"https://ragvivsw.space/categories/study/"}],"tags":[{"name":"school","slug":"school","permalink":"https://ragvivsw.space/tags/school/"},{"name":"device","slug":"device","permalink":"https://ragvivsw.space/tags/device/"},{"name":"think","slug":"think","permalink":"https://ragvivsw.space/tags/think/"},{"name":"Persist","slug":"Persist","permalink":"https://ragvivsw.space/tags/Persist/"},{"name":"money","slug":"money","permalink":"https://ragvivsw.space/tags/money/"},{"name":"blog","slug":"blog","permalink":"https://ragvivsw.space/tags/blog/"},{"name":"relation","slug":"relation","permalink":"https://ragvivsw.space/tags/relation/"},{"name":"play","slug":"play","permalink":"https://ragvivsw.space/tags/play/"},{"name":"people","slug":"people","permalink":"https://ragvivsw.space/tags/people/"}]}