{"meta":{"title":"Ragvivsw'ramble","subtitle":"orRecord","description":"不如记录","author":"Ragvivsw","url":"https://ragvivsw.space","root":"/"},"pages":[{"title":"","date":"2020-07-16T11:18:52.970Z","updated":"2020-07-16T10:49:38.301Z","comments":true,"path":"ls-README.html","permalink":"https://ragvivsw.space/ls-README.html","excerpt":"","text":"LandscapeA brand new default theme for Hexo. Preview InstallationInstall1$ git clone https://github.com/hexojs/hexo-theme-landscape.git themes/landscape Landscape requires Hexo 2.4 and above. If you would like to enable the RSS, the hexo-generate-feed plugin is also required. EnableModify theme setting in _config.yml to landscape. Update12cd themes/landscapegit pull Configuration123456789101112131415161718192021222324# Headermenu: Home: / Archives: /archivesrss: /atom.xml# Contentexcerpt_link: Read Morefancybox: true# Sidebarsidebar: rightwidgets:- category- tag- tagcloud- archives- recent_posts# Miscellaneousgoogle_analytics:favicon: /favicon.pngtwitter:google_plus: menu - Navigation menu rss - RSS link excerpt_link - “Read More” link at the bottom of excerpted articles. false to hide the link. fancybox - Enable Fancybox sidebar - Sidebar style. You can choose left, right, bottom or false. widgets - Widgets displaying in sidebar google_analytics - Google Analytics ID favicon - Favicon path twitter - Twiiter ID google_plus - Google+ ID FeaturesFancyboxLandscape uses Fancybox to showcase your photos. You can use Markdown syntax or fancybox tag plugin to add your photos. 123![img caption](img url)&#123;% fancybox img_url [img_thumbnail] [img_caption] %&#125; SidebarYou can put your sidebar in left side, right side or bottom of your site by editing sidebar setting. Landscape provides 5 built-in widgets: category tag tagcloud archives recent_posts All of them are enabled by default. You can edit them in widget setting. DevelopmentRequirements Grunt 0.4+ Hexo 2.4+ Grunt tasks default - Download Fancybox and Font Awesome. fontawesome - Only download Font Awesome. fancybox - Only download Fancybox. clean - Clean temporarily files and downloaded files."},{"title":"about","date":"2020-07-16T12:00:36.000Z","updated":"2020-07-16T12:02:23.411Z","comments":true,"path":"about/index.html","permalink":"https://ragvivsw.space/about/index.html","excerpt":"","text":""},{"title":"contact","date":"2020-07-16T16:19:38.000Z","updated":"2020-07-16T16:19:38.200Z","comments":true,"path":"contact/index.html","permalink":"https://ragvivsw.space/contact/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-07-16T12:00:30.000Z","updated":"2020-07-16T12:02:12.896Z","comments":true,"path":"categories/index.html","permalink":"https://ragvivsw.space/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-07-16T12:00:05.000Z","updated":"2020-07-16T12:01:53.613Z","comments":true,"path":"tags/index.html","permalink":"https://ragvivsw.space/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"200-02  总结上","slug":"200-02-summaryp1","date":"2020-08-19T03:30:08.000Z","updated":"2020-08-20T12:04:32.000Z","comments":true,"path":"2020/200-02-summaryp1/","link":"","permalink":"https://ragvivsw.space/2020/200-02-summaryp1/","excerpt":"年中总结。其实也不是总结，回顾一下而已。 习惯上还是以","text":"年中总结。其实也不是总结，回顾一下而已。 习惯上还是以「Chinese New Year」作为开始，毕竟如果有两次新年会很奇怪，而且一月份学期也没有结束。 0 今年发生了很多事，当然还是和以前一样，和我没有什么关系，只是会间接对我造成影响。 倒不如说非常想生活发生一些变化，一如既往的话过得没有感觉。 但是世界的变化终归是缓慢的，难以察觉的，不论有什么事发生。 就像那句，「我们常高估一年的变化，低估十年的变化」。 1 年初的大事开始，基本上就一直处于荒废的状态。待在家里什么正事都没有做，只是带着沉重的罪恶感，理所当然地浪费着时间。 因为也没有留下什么记录，完全忘记了还做过什么，只能就着遗留下的一些资料，看着写了。 日常方面，自己在家做饭占的时间最多，然后是带人。 其他时间，依旧多是浪费在电脑、平板、手机上，也不知道自己做了什么。 在浪费时间这方面，只要有电脑，即便没有游戏没有网，自己也能玩得不亦乐乎。 2 B站上花的时间最多，想来最主要还是看番。 之外还开始看直播了，刷到了 19 级，拿了三个牌子，等级是 7/9/11。 追了两三个月，之后就没有关注了。现在偶尔看看打发着本就不充裕的时间。 对直播感兴趣的起因早就忘记了。就像很多事一样，莫名其妙就开始，然后就一发不可收拾，最后突然就停下了，就没有下文了。 番主要是补了很多老番。毕竟没有会员，只能找找免费的好番了。 不得不说这些老番实在是经典，很多都重刷了，这在之前倒是没有想到。 想到这些新人都不怎么看了，确实痛惜。不过想我之前也没有了解过这些，倒也是可惜。 错过了何止一个时代。还是得说一句互联网就是好。 当然这是在电视如今的变化下说的，之前的电视上倒是什么都有，也不珍惜。 这里的电视是指夬视的那种，网络电视基本上和某某视频之类的没有区别。 就是屏幕更大，而且因为系统的封闭，广告也加得不亦乐乎。 当然和家里人看「天行九歌」，体验倒是还好。毕竟不常看，广告忍忍也就是了。 买会员的话，多少也有些内容。 说到电视，因为有会员，电影也看了几部。 看「十一罗汉」的时候，字幕看得真心难受，但是又不可能换。 现在想想，番也是，很多都不如之前了。 毕竟为爱发电和拿死工资的用心是比不了的。 字幕组没落了，但是换来了一个充斥着机械作业生搬硬套的字幕环境。 说到字幕，歌词也是，不是翻译的问题，而是屏蔽。 各种关键词，黄赌毒一丁点都不能有。 只有一个词能表达心情，每次看到***都是，「mdzz」。 反正上面说的东西都是，都越活越过去了。 想起那张表情包「了多放开们你比清大的朕，吧倒拉可」。 3 B站之外，还花了很多时间在社交媒体上。毕竟事关全球，当时对这事是非常在乎的。而且想知道更多信息，里面都 502 之类的了。 包括里面的微漙，还有外面的堆特、电扳之类的。 还在申报里记了一点东西。确实是一点，没有坚持下去。 而且这件事也不好写，写多了在里面就是不对的了。 在漙上面关注了很多人，开始是互联网相关的，然后自然就有医学方面的大佬了。 再一次见识到了派别斗争，还是全民向的。 之前听过导师的课，对中匿的认识偏向正式了一些，毕竟是从之前没见过的高度看。 之后就又偏到另一边去了，而且也不会再回去了。 这边的力量太大。毕竟大家多是无神论者。 要讲科学。 但是说服了自己从另一个角度来接受，毕竟还要吃饭的。不过这就不足为外人道了。 堆上面就是不出所料的非常符合想像的各种反功言沦了。 而且还看到了一些好像挺正式的，但是因为当时的罪恶感，就没有过多了解了。还是动漫要紧。 当然限于能力，只能混混中文圈。 见不到更大的世界，真是可惜。 当然中文这边虽然内容相对不多，但是无论如何是里面比不了的。 还是能更全面地见识到更大的世界。 当然就不可能都顺心了，人一多，就什么林子都有了。 总之当时一直是各种气愤成分居多，对各种相关的事。 当然后面就看淡了，因为想清楚了，说大也大，小也小，自己也做不了什么。 努力建设才是硬道理。 封面来源: 自己拍的 | Xperia XZ2","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[]},{"title":"200-02  总结下","slug":"200-02-summaryp2","date":"2020-08-19T03:30:08.000Z","updated":"2020-08-20T12:04:32.000Z","comments":true,"path":"2020/200-02-summaryp2/","link":"","permalink":"https://ragvivsw.space/2020/200-02-summaryp2/","excerpt":"4","text":"4 那么之后还是开学了，上网课。 怎么可能认真学呢？ 先是因为教材只有电子的，找资源、加书签什么的——当然是不同时期——弄了很久，之后又在 iPad 上各种花时间。 后是因为视频教学，又开始当松鼠了。 能下的都下了，但是显而易见没有什么意义。 最后全传到起星里去，没再看过一眼。 当时就是不肯静下心来学点东西，上直播课也听不进去。 恶性循环，落下愈多愈不想看。 最后考试也是靠着几天的恶补，勉强没有挂科，当然之前有写一点。 估计下学期也是这样。有任务有罪恶感是一样的，就希望能利用好不上课的时间吧。 5 其间还帮师姐那边处理了一些数据什么的。 当然不多，因为我觉得，或者说就是，除了我、家人之外的估计所有和我有关的人都认为我在家认认真真地准备考研。 形象塑造偏差了。 于是就没有太多事。倒是可惜了，如果有很大的外力的话，说不定会好一些。 自己在力所能及的方面帮助别人的兴趣还是非常大的，特别是事是和电脑相关的。 毕竟不帮别人自己也会把时间浪费掉，倒不如去见识些没有见过的。 当然很多还是重复性劳动，没有任何价值，除了进一步损害自己的视力。 其实用电脑也就是为了能把重复性劳动用程序完成，但是自己毕竟没有学什么，还在汇编语言入门阶段。 所以经常还是得自己手动完成。每次回想起来，自己真是完全不考虑身体的感受，不爱护一下，也别摧残啊。 每次看到关于眼耳的新研究进展就会比较激动，希望研究越快越好。 已经做好思想准备了。 6 还是要回学校，有些课没办法，再加上考试。 带防护用品，口罩带了 200，没用上一个。 还嫌带少了。 知道学校会发，自己也清楚不可能做到全天戴，每天换的。 有什么办法。 要自己带饭盒，还专门挑了。 后面才发现是最讨厌的那种。 四格，大小不一。 之前打饭，有提供这种的。菜肯定往小格里打，越贵——比如荤菜——挑越小的，反正中等的格子绝对不可能装肉。 最好是格子非常非常小，然后多多少少盖个底就够了，钱照收。 然后饭就能跟不要钱一样——当然成本确实很低——打不少，最好是往其他格也带一点，这样菜又能少打点，看起来也大方。 想想自己是真糊涂了。 后面打饭场景差不多和上面描述的一样，越想越亏。 后面换一家第三方管的连锁食堂，倒是好一些。 但是暑假只开了一个。 现在也还没打算再换一个，等开学吧。 现在实验经常都懒得去吃饭了，更不会想洗碗。 7 有段时间不吃饭，想着多打个菜，保证有肉。 还是不够，下一餐之前会饿。 果然还是不能像西方一样。国人传统还是只有米饭能吃饱，菜、汤什么的只是辅助罢了。 菜是不可能打多的，付了钱也不行。而且仿佛我们欠了食堂什么，打越少越好。 吃什么菜，吃饭还不够吗。 吃饭吃饱，长高长肌肉。土豆当主食，不行；土豆+米饭，行。 都是碳水。 虽然说学校食堂可能是比外面便宜一点，但也没有白嫖啊。 果然无论如何不能跟重点学校比。 当然这就是题外了，之后再讲。 学校之外，也理解还有很多原因。当初的现在的，就和匿一样，当然这个不多说。 自己反正是越来越看不惯这种现象了。但也改不了什么。 8 讲这么些饮食相关的，因为自己身体原因。 暑假把胃镜也做了，大问题也没有。反倒是不放心，是不是没有仔细检查？ 胃炎、反流。 药开了，抑酸的。中戌药就算了。 吃完就没了，因为要去学校，又出不去，对医务室也没有想法。 只能等下次了。 还有，真菌感染复发，还因为自己作，升级了。指甲也成了繁殖的温床。 说来惭愧，第一次自己去医院。 乳膏胶囊，中戌给开了 90 ，相比贵了一倍多。 胃的那个中戌 20 来，也就算了。 没领 90，再回去医生已经下班了，就不了了之。 西的说明书是真详细，不是开玩笑。看得出中戌正在略微看齐，没有可比性。 家长不放心，结果真把自己忽悠了。胶囊没吃多少，后面膏也没怎么涂了。 亏自己还在学微免。 等下次复发吧。 9 考完试之后的暑假才做了点正事。 重新继续汇编语言，又去把视频全下下来了，浪费不少时间。 果然也没有学多久，最近一个月都没怎么看了。 实验影响太大。只要知道之后有事，就会不断想着那件事。 说尽量不要影响学习，客套罢了，于我而言，只有 0 和 1 。 在实验室当然就满脑子实验，静下心来是不可能的，学习也没有效果。 就空那么一两个小时，要真开始学，到时间了是继续学还是实验？ 睡觉也不安稳，一是时间，二是已经不习惯睡桌子了。 后悔了，应该上个月开始做的。现在还要担心能不能搞定，总不能一直占着设备。 各种麻烦，还是那句，「早就是优势」。 10 开了个头的还有练字。 练了 17 天，停了。 还是实验。 本来就只打算偷偷摸摸干，在寝室已经是极限了。 人一多就没有动力。看我干什么？隐私啊。 可以早点回寝室，现在都是九点左右。 但是晚上一般没什么人，又比寝室好，可以打字。 所以现在打字还在继续，虽然有时候太忙了就算了。 录的音一转文本，嚯，什么乱七八糟的。 理想总是好的，现实总是坏的。 所以总是抱着最坏的打算，往好了做。 至少，最后不会太失望。 封面来源: 自己拍的 | Xperia XZ2","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[]},{"title":"200-00-标题","slug":"200-00-title","date":"2020-08-17T16:00:00.000Z","updated":"2020-08-18T09:00:00.000Z","comments":true,"path":"2020/200-00-title/","link":"","permalink":"https://ragvivsw.space/2020/200-00-title/","excerpt":"标题模板","text":"标题模板 三部分，用「-」分割：年月-序号-概括 eg. 432-10-甲乙 eg. 210-01-丙丁下 第一部分 当第一部分第三位为零 多为总结性，不区分月份 前两位表示年份，取年份后两位 后一位表示总结，无实际意义 当第一部分第三位不为零 前两位表示年份，取年份后两位 后一位或两位表示月份，不补零 eg 「210」为「2021年」总结文 「234」为「2023年」「4月」文 第二部分 当第一部分的第三位非零 表示日期，补零至两位数 当第一部分的第三位为零 表示序号，补零至两位数 eg 「432-10」为「2043年」「2月」的「10日」文 「210-01」为「2021年」的第「01篇」总结文 第三部分 当第三部分字数为二 文章概括 当第三部分字数为三 前两字为文章概括 后一字用来划分文章 eg 「432-10-甲乙」为「2043年」「2月」「10日」关于「甲乙」的文 「210-01-丙丁下」为「2021年」关于「丙丁」的第「01篇」总结文的下部分，内容接「210-01-丙丁上」 封面来源: Unsplash | https://unsplash.com/photos/sDqT3iD6vSc Photo by Kelly Sikkema on Unsplash","categories":[],"tags":[]},{"title":"207-27 金钱2","slug":"207-27-money2","date":"2020-07-26T16:04:00.000Z","updated":"2020-08-03T13:50:00.000Z","comments":true,"path":"2020/207-27-money2/","link":"","permalink":"https://ragvivsw.space/2020/207-27-money2/","excerpt":"有了充足的资金后，就使用倾向来看， 最大的一笔是投基金。当然","text":"有了充足的资金后，就使用倾向来看， 最大的一笔是投基金。当然日常饮食所需要的除外。 其他的呢？ 因为自己的东西比较少，基本上什么价位都有很多想要的。 只要能买就能提升幸福感，只要肯花。 比如几块的饮料；十几几十的各种零食，或者说副食；上百的键盘鼠标、Kindle、降噪耳机；上千的手机电脑；就得了，不妄想了。 当然价格不准确，就是大概意思。 买基金是真上瘾，毕竟看着钱变多。当然也有时候少，但总不至于没有变化。 因此一有钱就往基金扔。之后再往余额宝、零钱通之类——当然现在就这俩——存上一些，作为日用——零钱通当然是直接用掉，余额宝是为花呗留的——然后卡里就没几个钱了，只作为备用的备用。 估计标点符号使用不当，但先这样吧。 当然吃饭依旧是大头，所以基金的钱最后还是要取。 不过之外就不想动用里面的钱了。因此其他的，不管是不是需要，都是一拖再拖。 比如寝室的纸巾用到最后一包最后一半，才在某天想起来这件事，并且一直记着，加上刷着牙左手非常闲，搜了一下，最后洗漱完了拿出手机意识到再不买真的没纸用了，终于是下单了。 很多很多想买的，都考虑再三再四，依旧难以下手。想当初买手机、平板——当然上一篇说了——从起意到入手，浪费了几个月的时间，是真得浪费啊。 而且手机现在已经想换了，但是想才用多久，也就算了。 至少主力是电脑，其次是平板。因此不好用，忍忍也就是了。 有钱花在这，倒不如添置些没有的，毕竟从 10 就算到 1000，也不如从 0 到 1。 接回上面，因此现在主要的目标就是 Kindle、降噪耳机。事关视力听力，还是老话，失去了才会珍惜。 有闲钱都先留着，能省也尽量省一些。 当然这方面倒不用勉强自己，因为缺的不是用于购买的钱——毕竟基金里的钱全部取出来，也不管那些亏得老惨，还是不忍割肉的，买手机是够的——而是花钱的意识，或者说冲动。 还是没有办法很好地对待手里的金钱。 年前花光了买平板手机的那次，是借着看了相关文章的劲，并且是说为了考研——一是平板确实有用，二是不想着基金的涨跌了——才豁出去了，也是我个人而言买过的最贵的两件。 那现在，考研是无论如何指望不上了，各种意义上的。 那钱在基金里也就没有提的欲望。经常去看 Kindle 有没有降价也只是借口罢了，自己心里清楚。 真的不在意，也不用太在意那 50、100 的差价——当然 1、200 确实心疼，毕竟能买其他想要的——跟 7、800 的底价比起来。 写这些，还是打算说服自己。可惜啊。 其实想想，根本原因还是没有， 自己的稳定资金来源。 买了面包和豆粉，本来是嫌早上食堂太贵的，加一杯豆浆要 5.5 。 结果算下来还是要 4、5 块，当然营养是好了很多。但是目的没有达到， 钱花得不爽。 封面来源: Unsplash | https://unsplash.com/photos/NeTPASr-bmQ","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"}]},{"title":"200-01-网文上","slug":"200-01-webnovelsp1","date":"2020-07-26T12:44:06.000Z","updated":"2020-08-18T02:56:35.000Z","comments":true,"path":"2020/200-01-webnovelsp1/","link":"","permalink":"https://ragvivsw.space/2020/200-01-webnovelsp1/","excerpt":"本来想写番剧的，但是因为最近一直都在看，就不好开头。网文在初中、高中看的多，初中最","text":"本来想写番剧的，但是因为最近一直都在看，就不好开头。网文在初中、高中看的多，初中最多，拼了命地看，高中在学校多，没有设备，就没怎么看了。 说起来，看过的网文不算多，也就 20 本往右吧。当然这里说的是单纯的网文。比如之前在初中也看过大刘的「三体」、「球状闪电」这种现在非常火的科幻小说。 说到这两本科幻小说，接触的原因是当时在看现代科幻的类型——不包括「狩魔手记」，那我归为末世——现在有印象的一本是《全球进化》，讲大气出现粉色气体，所有生物进化，最后的老大盖亚是纯能量形态。还有一本是出了个人工智能，最后自然是带着男主走上巅峰，结尾是儿子接手。 那么重点是「球状闪电」，第一次没能看完。到主角大学回家，发现家里有人打扫、多出画了之类的这段剧情，就怕了：开什么玩笑，只是想看科幻过过瘾，你来恐怖故事，这初中的我哪受得了。 后面是再在奇书网——对，基本上都是在这盗版网站上找的资源——顺着这本又翻到了「三」，当时还没获奖，简介也比较少，主要是讲「水滴」，什么一滴水摧毁舰队。当时想的是这什么乱七八糟的。不过后面还是下了看了，估计是看这本评价确实比其他的好。 但是由于阅历的限制，那时候是单纯地当作网文来看的。只是为了过科幻瘾，没有想太多，或者说根本想不到什么，也无法理解。比如第一部里面爻革相关的内容。虽然是看完了，也没有留下什么印象。毕竟什么都不懂，所以初中最崇拜的，一是丁仪，二是托马斯维德，三是罗辑。其他的就基本上无视掉了。在高中，「三」获奖之后，又买了一套学校里推销的盗版书，重温了，才发现还有一个挺厉害的人，对，就是章北海。总之，初中只是单纯想看书而已。 至于「球」，等到了很后面才又捡起来看完了，才知道确实是科幻，而且设定很好——当然不好才怪了，可以说自己没什么资格评价——倒是可惜当初没有看完，不然…好吧我也不知道会怎么样。但是科幻接触的并不多，只是作为一个小分类，跟末世、——好吧说起来看过的类型着实不多，想想初中闲来无事还统计了一番似，乎也有一些，可惜忘光了——一起与玄幻魔幻之类抗衡。修仙类才真得符合当时的幻想啊。 那么网文里对自己影响最大的一本，也是自己看完的第一部长篇作品——对，非常遗憾，四大名著之类的经典现在都没看完过一本——是御宅传说的「噬魂天书」。作者和书名都记得非常牢。当然不是看过的第一本，第一本是初次接触自己家拥有的电脑的时候，在浏览器百度搜索了「电子书」——对，就是这么直接——然后百度就会有一栏推荐，挑了本顺眼的就看了。内容什么的早就忘记了，名字也不记得，唯一有印象的是等级设定以及结尾——对，也是玄幻。 说回，「噬魂天书」是表哥给推荐的，从书名就看得出，是传统的古代玄幻小说。说到书名，之后还看过「噬魂逆天」、「噬魂老祖」，想来是搜第一本的时候看到的，评价不错就看了。而且记得别人要推荐的时候，我都是先说这三本，然后就被问是不是一套的上中下三部。当然三本之间没有一点关系。「噬魂逆天」是西方魔幻、「噬魂老祖」是现代修仙，当然这本后面就走偏了，跟书名没一分钱关系，怎么说作者是学生，也就还是很厉害。当然今天重点不是这个。 估计因为是看的第一本，所以在滤镜的加持下，「噬魂天书」在我看来是一本非常非常经典的玄幻小说。里面很多的内容都奠定了我之后看其他小说时的世界观。 总设定，整个修仙宇宙和地球可以相通，修仙宇宙是后修仙时代——当然这些都是自己的理解，名字也是看着取的——繁华的时代一去不返，整个宇宙在经历了一场仙界的异变之后，已经没有再出过一位「仙」了——涉及剧透就不深入过多，虽然写的也没有人看——修仙分十等，现存的有练气凝神筑基金丹元婴炼神返虚合体大乘。宇宙是三千世界，大千世界只有一个，中千六十。还有各种经典的门派，看其他网文的时候总是看串。作者的设定相比于看过的其他小说，卡得挺严格的。修仙的终极目的就是延长寿命，但是到第三等的筑基期，寿命才能增加到两百。而一般小千世界明面上的最顶级元婴期高手，寿命也不过一千。看起来挺长，但是主角金丹之后闭关的时间，常是以甲子来计算的。至于长生不老，似乎只有飞升后才行，不过具体是不是这么设定的就不清楚了。 未完。 封面来源: Unsplash | https://unsplash.com/photos/qOA23ma39yY Photo by Michel Stockman on Unsplash","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[]},{"title":"200-01-网文下","slug":"200-01-webnovelsp2","date":"2020-07-26T12:44:06.000Z","updated":"2020-08-18T02:56:35.000Z","comments":true,"path":"2020/200-01-webnovelsp2/","link":"","permalink":"https://ragvivsw.space/2020/200-01-webnovelsp2/","excerpt":"续。","text":"续。 书中印象最深刻的情节也是和寿命有关。 讲金丹主角在一个中千世界遇到一位筑基女修士，带着貌似是两个女徒弟——当然具体的就记不清了——剧情略过，最后是修士年纪太大了，把两姐妹委托给了主角之后就走了。 就是这修士所谓寿终正寝这件事，给了我非常非常大的震撼。那毕竟是梦寐以求的修仙世界啊，修仙为了什么，除了力量，最大的目标自然就是长寿。毕竟所有人都怕死吧——应该吧应该吧——目前人类理想寿命也不过 120 ，对比着世界来说，实在是太短暂了——本来想念句诗的，还是算了——就我自己，可以说有死亡恐怖症。记得初高中的时候最严重——现在只要不成心往那方面想倒还行——有时候直接会想到喘不过气，睡觉的话也睡不下去了，得到客厅转两圈，散散心，等想法消散之后才敢躺回床上。 说回，而作者也花了一点笔墨来写这个情节，最后是在我心里留下了不可磨灭的印象。既然修仙者也会老死，那修仙还有什么意义呢？毕竟自己不是主角这点还是知道的，主角成长路上的各种巧合机遇太多太多了。就算真出现修仙世界，那自己也终究是平凡的一员罢了，就像那个修士一样，修到该世界的入门级水平就到头了。清清楚楚地知道只要能再前进一步，寿命就能加倍有余，然而没有只要。作者在这把最终的结局告诉了我，于是那些追求就变得如此无趣。反正终究是万事成空。 总之这种感觉现在很难写明白，反正只要说到想到这本小说，乃至只要说到网络小说，自己的第一印象就是这本书的这个情节。 那么顺便谈谈其他方面。首先，成人内容自然是不可避免的。毕竟怎么说「噬」是职业网文作家写给那些有付费能力的成年人看的，目标人群无论如何不包括我这种习惯白嫖的初中生。但毕竟众所周知国内在这方面。所以这可以说是看这类作品无法避免的，并且从某个角度来说，也算是某种启蒙了——只能说就我看来，不论如何比未知要好吧——说到这，突然想到其实还有其他的东西也是这样，但就太偏题了。 当然要说作品，中国并非没有一些非常优秀的武侠小说，还有那些大家写的，都是正式出版的。但可惜的是，自己完全被玄幻吸引了。玄幻小说的功法、招式的威力乃至世界观的庞大，是武侠完全无法比拟的。还有那些西方魔幻类也是如此，毕竟巅峰都是成神成仙的存在，触碰乃至成为世界的本源，真正的只手遮天，一念天翻地覆。相比之下，武侠就显得有些无力了，提到最顶级的功法，就是所谓北冥神功、九阳九阴、降龙十八掌之类，相比之下也不过尔尔。 还比如「噬」里面，元婴之后就开始掌握的「规则」，看起来很简单，但是配上自己的想象力，就会觉得莫名厉害。就像主角在初期的时候，就算是亲眼见着交手，也看不透到底发生了什么。就像想像四维空间一样，自己无法理解的领域总是有着致命的吸引力。相比之下，就不比了。 其实就算是西游记，孙行者法力通天，那也只是通天罢了。放玄幻里，标准开头——当然只是我的看法——应该是三十三重天已经破碎到只剩三重，太上老君在事情发生之前很久就已经不知去向了，之类的各路神通隐居在各种人迹罕至之地。而这一切的起因，是老君……当然只是瞎写。总之一定要有凌驾于现存一切力量之上的存在，未知的才有意思。 当然现存的设定改写一番也不是不行，比如有部忘记名字的，华夏的皇帝就写的很大气：龙威凝结成实体，数千米的神龙盘旋在万米的大殿上空——当然具体数据可能不对——这样想像起来真是能起鸡皮疙瘩，而且个人觉得这样才配得上「华夏」这个称号：毕竟如果都只是血肉之躯，那又如何称皇称帝，如何万古长存。 说回寿命，刚才说的，「噬」的设定比较严格。相比之下，其他小说比如「盘龙」，到小世界里一个比较顶级的位置就可以长生不老了，寿命直接到顶，主神的寿命更是以「亿」为单位来计算的，我感觉是有些简单了。毕竟到了那时，那么多人有无限的时间，而且主世界的混得比较好的人到小世界，动不动就天崩地裂的，就有些奇怪了：小世界就是纸糊的吗，当空间是什么了。当然还有另一个极端，一本直接就叫「永生」。出于好奇当时我先看了结尾，然后是主角们踏入了永生的大门。这个就有些过头了，因为这永生之门是谁设的，之上的力量没有看到啊。就像只是进了别人的世界，放其他网文只是第一卷的结尾还差不多。但这本又挺大的，于是就没有看下去的动力了。 总之，「噬」在我看来是很均衡的一本网文，唯一的缺点就是太监了。作者因为一次出差，隔太久没有动笔就没有动力，最后把没有写的设定用一大章放了出来。大体剧情是普普通通，但是具体内容我还是非常想看的，特别是关于「规则」的设定。毕竟是职业写手，而且剧情估计连一半都没有到，很多很多的伏笔都没有下文了。加上最精彩的部分肯定是在大千世界，这也是一大遗憾了。之后看的多是已完结的，想想和这不无关系。 还是想用看到的一个评论来评价，「半本神书」。 封面来源: Unsplash | https://unsplash.com/photos/qOA23ma39yY Photo by Michel Stockman on Unsplash","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[]},{"title":"207-25 时间","slug":"207-25-time","date":"2020-07-25T15:27:29.000Z","updated":"2020-07-29T14:25:44.000Z","comments":true,"path":"2020/207-25-time/","link":"","permalink":"https://ragvivsw.space/2020/207-25-time/","excerpt":"突然意识到自己的时间管理有够差。就是说没有意识。 触发点是看到一篇文章写的久坐问题","text":"突然意识到自己的时间管理有够差。就是说没有意识。 触发点是看到一篇文章写的久坐问题。 是老生常谈，1 小时至少站起来个 5 分钟。 自己有设屏保的，25 分钟一次。 没什么用了越来越。 一开始是会有意识地活动。 懈怠了。 其实说起来 5 分钟真的不算什么。 跟每天浪费的时间比起来。 早上 7 点起和 9、10 点就差了几个小时。 当然后者是因为晚上 2 点才睡。 这个先不说。 看文章也花了很久时间，一篇几分钟。 话说写起来才发现很难啊，几百字放公众号略滑一下就到底。 不过想想语文 800 字也一直够呛，一直不够模板化的原因吧。 有次找标了阅读需 2.3 分钟的，一看，2000 多字，啧。 想想之前弄简书、Blog 也是因为逼着自己写到规定字数才。 可不能这样了，就像练字一样，不想练了直接留下一天，千万别烦。 说回。 对时间的感知非常混乱。 晚上刷牙洗脸，看别人在洗衣服。 就想着大家都好厉害，天天认真学习那么久，还有充足的时间干这些。 仔细想想，看集番 20 分钟，三集小时，一部，通常是 12 集，半天没了。 但是站了个十几几十秒就开始觉得好久，是不是可以坐下了。 当然也是因为太沉迷了。 还有每日答题，虽然要不了几分钟，就是觉得麻烦，甚至不怎么需要动脑。自己想反而会错，毕竟书没看过多少，很多常识也不知道。 之前一直说放假了留学校里可以跑跑步什么的，也没动过。 因为时间打算在晚上，然后等反应过来，而且也没那么抗拒，一般都 10、11 点了，然后就因为时间原因不想去了。 还有各种事，比如中午再洗漱一次，也经常不去。还有洗碗也会拖很久，当然洗还是会洗的。 都是些小事，但坚持很难。 学习就更加，每天花点时间在英语上啊。之前总是跟别人说英语不好，也知道英语非常重要，要花很多时间。 结果一点都没花。 最近越来越飘了，不喜欢的索性不做。 也有室友的原因。 学霸旅游去了之后，都在娱乐，游戏小说。 当然不能推给别人。 想不到要怎么样激起学习的行动。 做喜欢的事的时候时间过得很快。充实的时候也是。 一下就过去了，然后得回到讨厌但是重要的东西上。 度日如年的，时间有够奇怪。 这叫什么， 相对论？ 封面来源: Unsplash | https://unsplash.com/photos/BXOXnQ26B7o","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"}]},{"title":"207-24 理发","slug":"207-24-haircut","date":"2020-07-24T12:12:56.000Z","updated":"2020-07-25T14:02:32.000Z","comments":true,"path":"2020/207-19-haircut/","link":"","permalink":"https://ragvivsw.space/2020/207-19-haircut/","excerpt":"5 月 14 过来的，两个多月了，第一次出校门。 头发当然很长，不过似乎不如在家里留的","text":"5 月 14 过来的，两个多月了，第一次出校门。 头发当然很长，不过似乎不如在家里留的。 只有一个校门出去，当然文件下来之前只能请假，我是一直觉得太严了，完全没必要。 去的上次留校或是放假去的那家，就去过一次。 平时都去另一个校门的，但是没办法。 不是老板，看技术是学徒的样子，跟那家一样，一个技术高的老板，和一个一般般的。 就说是学徒也不如另一家，看来学得不怎么样。 推子直接朝耳朵怼，第一次知道原来这么吵。 当然可能是太久没剃了，也可能是中午没睡神经又衰弱。 剪子用得不流畅，就是不流畅，各种意义，不只是因为一点点剪的那种。 还要握握头发来看长度，或者是为了其他，反正没见过之前。 走路也不大注意，几次踩到鞋子，因为穿的拖鞋比较注意，还好都没踩实。 话不多，和那家店一样。 旁边老板在给室友唠着，也好，喜欢安静。 就开始乱想。 自己的头发只能说自己现在的头发，毕竟过几个月就全换了。 自己身上似乎没有多少是自己的。 大脑？好像没了。 再说就是基因了。 那么你只能说是一块大脑，和一串 DNA 的排列组合。 这是物理上的，精神上的呢？ 记忆，没了。 全部的感性理性认识，都是基于过往的一切。 但连记忆也是模糊不清的。 可悲啊，人类。 当然自己的认知实属一般，胡思乱想很多也都是错的。 就这样吧，懒得去查证了。 说回理发。 剪完了，再洗一次？算了，待会洗澡。 店里的洗发水不怎么样，洗澡的时候感觉头发很涩，当然不清楚是不是因为这个，而且这是后话了。 结账，涨价，不办卡 25 一次，记得上次 15，看门口牌子也是洗剪吹 15，可能是没仔细看。 办卡 50 三次，上次老板给剪的，也是提着办卡的事，应该是 100 八次？记不清了。 办呗，不然太亏了，毕竟不知道另一个校门会不会开。 那家年前刚充了 120，八次。 当然就不在意了，只能说过去花的钱都不是自己的了，所以投资确实是很好的选择，白捡钱一样。 说回，主要是这家技术更好我觉得，附近另一家年前不办卡也是 15，但去一次就算了。 老板看起来也更加实在，Tony 老师也看脸啊。 就回来了，洗澡，头发不好受，可惜搬寝室没带护发素，太急了。 才想起来前两次的衣服没洗，一直说手洗来着， 泡了四五天了。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"school","slug":"school","permalink":"https://ragvivsw.space/tags/school/"}]},{"title":"207-23 平板","slug":"207-23-iPad","date":"2020-07-22T16:01:29.000Z","updated":"2020-07-26T11:05:45.000Z","comments":true,"path":"2020/207-23-iPad/","link":"","permalink":"https://ragvivsw.space/2020/207-23-iPad/","excerpt":"给平板配了键盘之后用了一段时间，打字的时候那个虚拟键盘一直都在","text":"给平板配了键盘之后用了一段时间，打字的时候那个虚拟键盘一直都在。 不光占位置，要选字的时候还得去点，用数字是没用的，今天才去搜了一下，在贴吧看到了解决方法。 得关掉两个地方，就很迷，说是为了方便没有键盘的人用鼠标打字，不大清楚。 不过一般的热门键盘都会有一键切换按钮，挺方便。当然我的没有。毕竟小众，而且是欧版。 说回键盘，本来 Windows 下的键位就不同，欧版的按键看起来更是奇奇怪怪。 当然能用就是，键盘买回来的时候 f 键抽风，不知道是不是本来就有问题还是快递暴力。不过看包的挺严实的，估计是卖家不诚实。 最后是把键帽用点力撬了几次，现在用着还好。 偶尔还是会抽风，撬着撬着莫名其妙也就好了。没好就多来几次，只能先将就着了。 跟卖家说了一下，退了一部分钱，这倒是意料之外。 习惯性给了好评，就别在这上面浪费时间了。 说回板子，iOS 的生态不知道，但是系统做得确实是一流。 各种流畅的非线性动画加上这 120Hz 的 LCD 屏幕，用着着实是享受。在设置里试过降帧，感知很强。 也因为屏幕和帧率，电用得很快，特别是看视频的时候。不过看番注意不到时间也是很大的原因，再省电也没用。 四扬声器也是用过最好的，相比之下电脑是真得差劲。当然因为在寝室就算了，都得老老实实上耳机。 以及运存管理，应该说后台管理，没用过确实难以想象，只能说封闭有封闭的好。 因为习惯了安卓加国产软件各种流氓式操作，不用些额外的手段实在想不到退出程序之后还真就退出了。这一晚上一点电不掉对安卓机来说也是奢望。 各种交互也很舒服，比如这个鼠标的选择方式，倒是从没想过能这么设计，不得不叹服。 之外还有很多设计，暂时说不出来就算了。比如屏幕使用时间，各种使用确实是一目了然，天天浪费那么多时间。 真有种全 iOS 的冲动，毕竟想想之前花的时间最多的还是电脑上，各种统计确实很想直观地看下。 当然这代价还是挺大的，没钱确实玩不来。 只能说各种问题归根到底， 还是钱的问题。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"device","slug":"device","permalink":"https://ragvivsw.space/tags/device/"}]},{"title":"207-22 思考","slug":"207-22-thought","date":"2020-07-21T16:01:29.000Z","updated":"2020-07-26T15:17:25.000Z","comments":true,"path":"2020/207-22-thought/","link":"","permalink":"https://ragvivsw.space/2020/207-22-thought/","excerpt":"的只有夜深人静了 ，才开始胡思乱想 。 好似一直是这样 ，越是安静，思维越活跃","text":"的只有夜深人静了 ，才开始胡思乱想 。 好似一直是这样 ，越是安静，思维越活跃 。 这么看，要是打算聊些想看法之类，应该在三更半夜找我。 当然得我没睡 ， 一到白天就不想说什么了，单纯看着便足矣 。 打字也是，若是白天，会想着这些个东西有甚么写出来的必要吗 。 之前的很多事，也找到了些许原因 。 可谓是见光死 。 自己所做的 ，想让人了解，又不想让人知道 。 打字也是，搭网站也是 。 就是看到了，也是不要评论为好 。 一说就觉得难堪 。 属于知道自己做得不好，狠下心来做了 ，便已经是极限了。 若是谁再那么一评论 ，哎呀呀，哎呀呀 ， 就没有动力了 。 还有学习也是，不想让人知道自己在学习。 也不是说想隐藏着什么的。主要是说是在学习，但更多的其实是在玩。 是真的无心学习。 也不是说沉迷游戏，最近也不玩了。 学习总是想用到一些道具。譬如期末考试，就说那门最接近挂科的。 上一门考完后还剩半天多的时间复习。 浪费了半个下午先。 因为没什么笔记，先是打算按照大纲把知识点整理到文档里，然后发现太慢了。 打字慢，要点又多又杂的。 老老实实用书。 也不是纸质，因为板子上的课本里还有一点笔记。 开始整理。 最麻烦的是什么呢？ 总想着尽善尽美。 各种没必要。 线画得直不直、划线和字的间隔宽了窄了、荧光笔画的最左端有没有对齐… 弄过来的图片是不是要裁剪一下、文本框的大小和底色要不改一改、这图片是不是被挡了东西… 这一页要删掉吗、虽然没有笔记但是还可能用到吧、要不还是留着，虽然最后一眼都没看… 之后很多零零碎碎的知识点还是整理到了文档里，又是各种打字排版换字体调边距，浪费时间。 最后是靠着再在纸上抄一遍来强行记忆。 因为背的没效果，完全背不下去。 就是不想。 自从回学校，不，自年初就这样了。 确实完全打乱了生活轨迹。 越来越下去了。 平常思考，或说胡思乱想的也不是学习，净是些杂七杂八的。 静不下心。 肯定是和睡眠质量有关，自大事之后——其实还能再往前追溯，就没必要了——睡眠就不行了，思想愈加混乱。 果然还是不要总出去，外面，太吸引人，各种意义的。 没办法，逆反心理还是有的，越，就越，隐政呃于是便愈吸引人。 还要考政治呢，150 分，这怎么行，老老实实待里面。 思想纯一些吧，至少， 先熬过这关。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"}]},{"title":"练字","slug":"Practice-words","date":"2020-07-19T13:12:34.000Z","updated":"2020-07-20T13:26:01.000Z","comments":true,"path":"2020/Practice-words/","link":"","permalink":"https://ragvivsw.space/2020/Practice-words/","excerpt":"207-20 第「二」天","text":"207-20 第「二」天 Day 2参考字帖：第一页 莫得感情的划线机器. PW07200 Day 1参考字帖：第一页 *看着画出的弯曲的线条像扭曲的栅栏一样把你阻拦在练字的大门外,这使你充满了决心. PW07190 Day 0字帖到了，开始练字 图源知乎","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"Persist","slug":"Persist","permalink":"https://ragvivsw.space/tags/Persist/"}]},{"title":"207-19 金钱","slug":"207-19-money","date":"2020-07-18T16:01:29.000Z","updated":"2020-07-19T12:04:32.000Z","comments":true,"path":"2020/207-19-money/","link":"","permalink":"https://ragvivsw.space/2020/207-19-money/","excerpt":"愈发意识到钱的重要性。 算了一下，一天吃饭吃了","text":"愈发意识到钱的重要性。 算了一下，一天吃饭吃了25。 也不是说很多吧，月750，但这是基本消费 想之前大一的时候，一个月消费不会过700吧。 确实是有意识地省着，天天逛羊毛群不亦乐乎。 都是高中人家玩剩下的。 还是接触太晚。 这类群基本都退了，留着的也全屏蔽了，完全屏蔽的那种。 那最近又想着撸毛了。 想给板子配一套蓝牙键鼠，倒是后悔之前买的无线鼠标，得连接收器，只够电脑用用。 其实年前还没出大事的时候看 iPad 的教程就有推荐的键盘，那时候没钱，就没有考虑过键鼠，现在已经找不到了。 考虑过原装的、百来块钱很火的，然后看到有人十几块买了个，甚至不到10块都有，还是旗舰店。 车早走了，下一次也不知道。 只能说直播对部分消费者，还是很实惠。 心里就不平衡了。 其实跳出来想想，也就十几块。 没必要，真的。 前几天洗被套，花了十多，也没什么感觉；还有那些付费文章，有的一篇十几。 因为花的是银行卡里的看不到？ 然后今天赶快在闲鱼选了个近两百的，有小红点的。 直接就付了钱，赶快解决吧，时间宝贵。 想想之前买板子，几千也花出去了。 当然这笔是值，放现在是赚不少。 还有手机，一千五，买的时候没注意电池，亏了一些。 也就这样，不多出点确实买不到好东西。 就想啊，看的很多公众号主都月入过万，大十几几十的也不少。 那么买一套 Pro11 + 妙控，万来块似乎也不算什么。 当然，是说都有经济来源，所以钱确实自己的，而且看着增加。 想那些能经常测评数码的，也都很好，加上测评也能获益。 共同的特征是什么呢？ 能心安地买自己想要的。 不用考虑太多。 从开始的吃饭，不用多想吃什么，然后盯着标价算钱，不用在意打菜少了，顺便带瓶饮料也不必挑着便宜的… 到自己想买的一切东西，当然是日常用品，都不必太过在意价钱，不用看了又看，然后因为小十几几十的差价纠结半天，拖上十天半个月还没决定好。 年前买板子，纠结了很久，说两三个月不为过，真的。 从苹果看到田牌，再到安卓，最后回到苹果，从二手看到全新，淘宝苏宁京东拼多多，再回到咸鱼… 当然确实不是小件，但是终归是要买的。 花钱省时，主要是省心，可以专心在想做的事上。 真想省也省不下多少，看文章所说，以及亲身体验。 当然眼光放远一些。 只能说赚钱这事， 最体现能力。 封面来源: Unsplash | https://unsplash.com/photos/NeTPASr-bmQ","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"}]},{"title":"207-17 博客","slug":"207-17-blog","date":"2020-07-17T10:23:35.000Z","updated":"2020-07-17T10:39:30.000Z","comments":true,"path":"2020/207-17-blog/","link":"","permalink":"https://ragvivsw.space/2020/207-17-blog/","excerpt":"又去把网站搭起来了，折腾了两天。毕竟不能白瞎了十年的域名，虽然没有备案什么的，不过现阶段都不是重点","text":"又去把网站搭起来了，折腾了两天。毕竟不能白瞎了十年的域名，虽然没有备案什么的，不过现阶段都不是重点。 弄这种不会的，就是边搜边做。 当然说是在实战中经验提升最快，但是如果连基础知识都没有，那其实都只是白搭，也就是在之后的系统学习里可能会有些熟悉的感觉，其他就没什么了。 就像自己写了两个脚本，也就是初步理解了几个函数具体的功能，都是抄的。 抄还抄不好。 系统学习才是王道，省时省力。 那么说回 blog 。 一开始的步骤都是顺的，毕竟弄过几次了。 搭了两天，一天半的时间是在改主题。 换了四五个，没有满意的。 也不是说没有，就是差那么点意思，眼看就… 不会改。 就换回用了几次的那个主题。 大致换了下背景，调了些透明度，加了俩特效… 只看出一个，另一个没弄出来。 捣鼓老久，算了，没必要。 就这么用着先，还是，现阶段都不是重点，字都没打多少，有意思？ 当然瞎玩的确有，但没那么多时间给浪。 先将就用着，待学了汇编，C，Py，再来会会 Html 。 学不进去主要。 没有动力，没有精力。 失眠得厉害，睡不好自然没精神。 这在之后写，继续 blog 。 花里胡哨的也没弄了，什么计数、评论、页脚、音乐… 怕又折腾老久，现在也不早了。 以后再说，兴许得再换换主题。 加载太慢，一是背景，二是动画。 背景图已经转成 webp 了，还是慢。 也没有什么图床支持这格式，不知道为什么，一分享出来，还是 .ipg 。 动画难改，得去找对应文件，主要是改，不会。 之前还加过头像旋转的，弄了挺久，没改出想要的。 想来是能实现的，能力不足。 加起来，先得等图加载完了，再出贼慢的动画，才出字。 当然这先后顺序就更是复杂的内容了，退一步说，图片还能再压一压，动画也勉强能改改。 网页框架的事就算了，怎么得搞崩溃几次。 先将就着吧，反正，没人。 那还是搭了，至少是有这么个地方。 总是留了点东西。 这就算是第一篇了，前几次的就算了，上次的直接被顶没了，倒是可惜。 也不可惜，看样子是能回滚，但还是算了，之后再看。 也没弄引擎收录，困了，一天没怎么挪地。 还有其他事。","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"https://ragvivsw.space/tags/blog/"}]},{"title":"207-15 期末","slug":"207-15-finals","date":"2020-07-15T07:12:34.000Z","updated":"2020-07-21T05:03:27.000Z","comments":true,"path":"2020/207-15-finals/","link":"","permalink":"https://ragvivsw.space/2020/207-15-finals/","excerpt":"出了一门成绩 差两分挂科。 老师人好，只能怪自己不学","text":"出了一门成绩 差两分挂科。 老师人好，只能怪自己不学。 就是熬夜的那科，合着没学多久。 最后一整段的复习时间是连10小时都没有。 松了一口气。 当然考得差是没什么好说的，像上上次一样，拉低绩点。 而且对我来说是重要的学科，对，那次也是。 总是考太差才发现这课是重中之重。 追悔莫及，无可奈何。 怎么放松呢？ 没出成绩之前是想着能不能拿奖学金的。 就是出了两门没上 80 的，也还想着。 就是不能给丁点希望。 那么反而就不紧张了，可能性归零。 其他科目多少也没之前那么重要。 也在打着音游。 想着是一个道理。 精确度有五个档次，头两档能拿满分。 那么按满分 100，评价也有五等。 一等满分，隔 5 分二三等，再隔 10 分四等，五等不管。 但凡有一个点岔了。 精确度三档开外。 至少差上 1 分。 眼看一等没指望了，就不会绷着了。 毕竟要掉到三等还有几次出错的机会。 对，容错反而增加。 而那些只能拿四等的更加。 倒是没拿二三等那么放松，因为没什么兜底。 但是玩着倒是不亦乐乎，倒不是说喜欢被虐。 但会错过很多，就跟捡分一样，往死里点着就对了。 也不用考虑精准度，能点到就不错。 对，期望是降低了，毕竟实力在那里。 那么学习排名也是。 当然现在没什么用，至少对我来说。 123 名是要绷着的。 从第 1 到第 2 和从第 7 到第 8，不是一个概念。 那么二三十开外，差上十几名才有感觉。 想到个词， 边际收益递减。","categories":[{"name":"study","slug":"study","permalink":"https://ragvivsw.space/categories/study/"}],"tags":[{"name":"relation","slug":"relation","permalink":"https://ragvivsw.space/tags/relation/"}]},{"title":"207-14 放纵","slug":"207-14-indulge","date":"2020-07-13T16:12:34.000Z","updated":"2020-07-21T02:56:02.000Z","comments":true,"path":"2020/207-14-indulge/","link":"","permalink":"https://ragvivsw.space/2020/207-14-indulge/","excerpt":"考试或者别的什么之后一定是放纵。 不是游戏就是B站视频","text":"考试或者别的什么之后一定是放纵。 不是游戏就是B站视频。 往往两个都有。 一是自己的问题。 二是环境。 只能说二本学校毕竟是二本。 除了学习氛围，也有各种吐槽的。 总是不好的。 得想想办法控制。 但是没什么效果。 强迫着忍着，一段时间后只会是更大的反扑。 只能说该浪费的时间还是得好好地浪费掉。 当然不能完全听天由命。 B站就多看知识科普类up，像罗老师 仙人 回形针是看得最多的。 其他的也有，偶尔看看。 都更新得不快。 番剧没办法，尽量找泡面番，追番也不错，都是周更，多想看也没办法。 那么游戏。 手机没有，习惯了，也只用二手破手机，看看公众号就行了。 电脑，steam好久没动过了。 首先是挑大一点的游戏，像巫师，加上steam，启动、过场都要半天的。 没太大动力打开。 当然得先通关了，这还是得玩上一段。 所以游戏是有的，也好玩，但就不怎么想开了。 平板。 有个音游，毕竟这也是买的原因之一。 也同理，开场慢，打开就有压力。 加上有难度，玩不好找罪受。 也好一些。 当然说的都是平时，像一些相对比较折磨人的事之后，或者是之前。 考试、旅途、实验之类。 就控制不了了，难收住。 对，说的就是这次。 停不下来，完全的那种。 下意识地也不想控制一下，就这么玩下去了。 主要是没有通关，虽说音游的剧情肯定不会太好，公认的。 但就是太喜欢故事了，不管是多烂多差的故事，都有看下去的想法。 当然这剧情算是好的，不是平铺直叙，多得靠自己想像。 平常是感觉一般的，因为精力不在这，就喜欢直白的，游戏也挑那种无脑的，虽然玩得不多，比如死火。 但是考完试了，感觉精力无从安放，加上睡眠依旧不好。 先通关吧，主线剧情打完估计会好一些。 唯一的阻碍是人名，外国人名总是不好记，加上很多都是开头字母相同的，经常分不清楚。 那就没那么入戏，看混了就尴尬了。 游戏里面还是有些学问的，贵的是有道理，而且难度也高。 当然得说各种游戏都没那么简单。 看贴吧里讨论的也不错，各种分析，经常有新人入坑。 不太想参加就是。 补： 主线的主要剧情打通了，离大结局还有一段。 突然不想玩了。 统计一下时间： iPad 一共打了 20 多个小时… 当然还是 B站 时间没有全部统计，不然比这长多了。 想想自己又不是后浪… 放纵过头了还是。","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"}]},{"title":"207-10 分别","slug":"207-10-separate","date":"2020-07-10T14:25:35.000Z","updated":"2020-07-27T15:52:47.000Z","comments":true,"path":"2020/207-10-separate/","link":"","permalink":"https://ragvivsw.space/2020/207-10-separate/","excerpt":"","text":"大学留了一个组织，三年。当然正式干活也就一年半，这半年更是，就当不存在吧。 同部门四个，同级的也就七个，实习 / 培训，都走了。 最后一人留着吃了顿饭，简简单单。 说实话不习惯跟别人吃饭，没什么聊的，尬着难受。 一是各个方面相差的太多，当然这是自己主观因素。二是自己习惯当旁观者，只是看着故事发展。 像平常的一些事，也不会记着。不如说刻意忘记，过去了就算了这样。现在因为打字才慢慢回忆。 所以越是平常的话题越插不上话，除非聊一些比较针对性的东西。 但那也没太多可以说的。 当然这都是我自己觉着。别人邀了，自然奉陪到底。 硬是拖了两个半钟头。 忍着没看手机。太习惯了，动不动就伸手。 聊了些家长里短的。主要还是高考相关，记得比较清楚。 因为时间距离比较近，心智发育得也还勉强，所以才有感觉。 那时多天真啊，太天真了就是。自己没有坚持，不然… 当然看过去的每一步都是错的，错得离谱，就不展开了现在。 也说着如果之后是去哪里哪里发展的话，以后再能见面的难易。 再有就是大家的近况，因为在群里一直都是潜水，感觉插不上话。以前喜欢发表情包来着，也不想，或者说不知道发什么合适了。 线下在年后基本也没什么交集了，毕竟都有自己的事。 其实，主要是自己一直这样，过去的朋友也没有联系了。 一个都没。 从不主动联系，想着大家都有自己的生活，有了新的同学朋友。 如此不就好了吗？珍惜当下。 过去的就过去吧，留在回忆里就好了。 当然主要也还是自己的问题，这里也不细说，偏题。 那么说回。 不过其他的也记不大清了，自己的脑子啊，太不争气。 没话说了也就干等着，只是不想太快结束。 当然很多事，确实是第一次说出来，对着别人。 性格是这样，你不专心听，我也没有讲的欲望。 很多事会在心里倒腾老久，自言自语的，想着一对一的场景，再慢慢地有一搭没一搭地聊。 不过也就这么想想罢了。 毕竟想说也说不出太多，都忘干净了，嫌无聊。临要自己说了，才知道自己语言组织能力的差劲。 偶尔说到一些时事，也限于你听过…听过的如此，没有思考过，自然没有深入下去的想法。 到底是朋友少还是不愿说呢，反正都是自己的问题。 近八点要走了，去超市带了点东西。自己什么都没买，似乎没做对。 现在想来，至少捎瓶饮料啊，空着手总是不好的。 终是要结束的，路上还是尽量走慢些。 无言。 还是有些故事的感觉了，自己的故事，感觉奇妙。 真真切切有种主角的感觉。当然也因为朋友的不断暗示烘托，氛围我才感觉到了。 毕竟真没怎么意识到，这确是最后的几面了。 到岔路口了，拜拜就是了，年后再会吧。 再有什么似乎也没有意义了，毕竟就这么两人。 没有回头。 封面来源: Unsplash | https://unsplash.com/photos/jNUhi5HFW1I Photo by Fabrizio Conti on Unsplash","categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"}],"tags":[{"name":"people","slug":"people","permalink":"https://ragvivsw.space/tags/people/"}]},{"title":"1910-09 体会","slug":"1910-09-taste","date":"2019-10-09T05:50:00.000Z","updated":"2020-08-02T06:10:27.000Z","comments":true,"path":"2019/1910-09-taste/","link":"","permalink":"https://ragvivsw.space/2019/1910-09-taste/","excerpt":"昨天晚上在想的。 前天在车上玩了「我在七年后等着你」，DLC 也通了","text":"昨天晚上在想的。 前天在车上玩了「我在七年后等着你」，DLC 也通了。 那些关于时空的故事，真是能被玩出花来。不合理之处肯定是有的，这个无论如何都不能避免。不过看过一些故事，设定都不重样的。 故事本身是感动路线，核心依旧是爱情。当然想说的不是剧情，说不出太多所以然。查了下 TapTap，9.9，也不需要说什么了。 是想了想故事之外的一些东西。不过自己也没有想太清楚就是。 感觉写故事和做菜一样。 也不对。 就是比如说，喜欢吃辣的人，除了直接吃辣椒外——当然一般不会这么做吧——都是借助着主食，当然不止指饭，来体会那一点辣。 就是说核心是辣，但是直接去体味是没有太大意义的，得配合这辅料，甚至是一些阻碍，之后自己再从中体会到的才是想要的感觉。 而故事也是这样。 借助着故事，让人体会到——就「七等」来说——满满的伤感以及一线喜悦，当然这是我个人而言。 这依靠其他是难以实现的，比如单纯的小说的话，就没有自己探索发现的感觉了。代入感不是没有，但确是不如自己操作的游戏。 然后还有单纯承载着快乐的故事，或者有着更加复杂情感的故事，等等等等。 现在想到，音乐也一样，或者说差不多吧。 就有歌词的来说——或者是纯音乐？好像不好解释，还是先带上词——整首的曲调以及大部分的歌词都是为了烘托高潮或者关键部分歌词所表达出的情感。 只有完完整整地听了，并且理解歌词——也不是说完全理解，就比如不能是看不懂的外语——才能最大限度地感受到作者真正想要传达的。 像没有歌词的话，就说那些有变奏变调的纯音乐来说，单纯看改变的地方是没有太大意义的，得放到整首曲子里，那么微小的改变也有要传达的感情。 补： 因为是太久之前的，所以故事什么的都快忘得一干二净了。 当然感动依旧是有的，一些关键的重要的情节也有模糊的印象。 谁会想到呢？ 在吾爱破解看到的资源，加上火车上正好的空闲，然后想起来有这么一个好像可以打发时间的。 就给了我本来平平无奇的旅途， 一个回忆。 End 封面来源: 自己截的 图片来源: 自己截的","categories":[{"name":"game","slug":"game","permalink":"https://ragvivsw.space/categories/game/"}],"tags":[{"name":"emotion","slug":"emotion","permalink":"https://ragvivsw.space/tags/emotion/"}]}],"categories":[{"name":"life","slug":"life","permalink":"https://ragvivsw.space/categories/life/"},{"name":"study","slug":"study","permalink":"https://ragvivsw.space/categories/study/"},{"name":"game","slug":"game","permalink":"https://ragvivsw.space/categories/game/"}],"tags":[{"name":"introspection","slug":"introspection","permalink":"https://ragvivsw.space/tags/introspection/"},{"name":"school","slug":"school","permalink":"https://ragvivsw.space/tags/school/"},{"name":"device","slug":"device","permalink":"https://ragvivsw.space/tags/device/"},{"name":"Persist","slug":"Persist","permalink":"https://ragvivsw.space/tags/Persist/"},{"name":"blog","slug":"blog","permalink":"https://ragvivsw.space/tags/blog/"},{"name":"relation","slug":"relation","permalink":"https://ragvivsw.space/tags/relation/"},{"name":"people","slug":"people","permalink":"https://ragvivsw.space/tags/people/"},{"name":"emotion","slug":"emotion","permalink":"https://ragvivsw.space/tags/emotion/"}]}